---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFlexPatternParam
source: html/0e7d9044-386a-8602-869b-287614f8b41b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFlexPatternParam Property

"Flex Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFlexPatternParam { get; }
```